Mikhail-Za/trail-mate-T-display-p4-/builds/esp_idf/targets/tdisplayp4_amoled/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
# Trail-mate runs as a guest app inside the DualMesh launcher's partition table,
# which has no coredump partition -> flash coredump spammed "No core dump partition
# found!" every boot and could never work here. Dump over UART instead (works without
# a partition; a crash prints a decodable ELF dump on the console).
CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
# FATFS long filenames: the SD content uses names longer than 8.3 (guide articles
# like 01-first-priorities.txt, waypoints.tsv). The IDF default (LFN_NONE) can only
# read/create 8.3 names, so those files failed ("could not read" / "SD write error")
# while short ones (03-fire.txt, lastfix.dat) worked. Enable heap-backed LFN.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_TRAIL_MATE_T_DISPLAY_P4_PANEL_RM69A10=y
CONFIG_TRAIL_MATE_T_DISPLAY_P4_PIXEL_FORMAT_RGB565=y
CONFIG_TRAIL_MATE_T_DISPLAY_P4_LVGL_BUFFER_LINES=80
# The shared IDF app shell (esp32_lvgl_idf_app_registry.cpp) references montserrat 20/24
# unconditionally since the P4 header/top-bar reflow; only montserrat 14 is compiled by
# LVGL default, which left this target unbuildable. Same fix as tdisplayp4_tft.
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
# ChaCha20-Poly1305 for team-mode AEAD (IdfTeamCrypto): off by default in ESP-IDF's
# mbedtls Kconfig; without these the link fails on mbedtls_chachapoly_auth_decrypt.
# Same fix as tdisplayp4_tft.
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y
# Offline Translate app: Arabic shaping + RTL (same as tdisplayp4_tft).
CONFIG_LV_USE_BIDI=y
CONFIG_LV_USE_ARABIC_PERSIAN_CHARS=y
# Offline maps + SD content stack, same as tdisplayp4_tft (this variant has the same
# SD slot): LVGL POSIX FS driver on 'A:' -> /sdcard, PNG decoder for tiles, CLIB
# malloc so big decode buffers land in PSRAM, JPEG decoder for Field Guide photos +
# satellite tiles.
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=65
CONFIG_LV_FS_POSIX_PATH="/sdcard"
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_LV_USE_TJPGD=y
